app/controllers/games_controller.rb

  def create
    @game = Game.new
    @game.initial_deck
    # @game.guess = []
    @game.cards = @game.cards.shuffle
    if current_user
      @game.user = current_user
    else
      redirect_to new_user_path
    end
    if @game.save
---
INSERT INTO "games" ("cards", "guess", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def edit
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @game = Game.find(params[:id])
    @cards = display(@game)
    p find_set(@cards)
    if !@game.guess.include?(params[:game][:selected_card])
      @game.guess << params[:game][:selected_card]
      @game.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "games" SET "cards" = $1, "guess" = $2, "points" = $3, "updated_at" = $4 WHERE "games"."id" = $5