app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]
---
  def destroy
    User.find(session[:id]).destroy